package gb.Khelmyanov_HW.Lesson3;

import java.util.Arrays;

public class Lesson3 {
    public static void main(String[] args) {
        //Создать массив со словами
        //Сделать генератор случайных чисел который будет выбирать слово
        //Разбить слово на символы и записать их в новый массив
        //Ввод попытки слова пользователем
        //Разбить слово пользователя на символы и записать в новый масссив
        //Создать массив со звездочками
        //Сравннить слово компьютера и пользователя и внести угаданные буквы в массив со звездочками
        //Если все символы совпадают вывести поздравление если нет дать пользователю возможность снова ввести слово

    }
}
